a="Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.."
print(a)

с = input("покрытая …")
d = ("покрытая " + с) 
e = input("кожиц..ей")
n = 
g = ("кожиц" + f + "ей")
h = input("затянута ...")
k = ("затянута " + i) 
l = input("нижняя ...")
n = ("нижняя " + m) 
e = ("шляпк..")
g = input("шляпк " + f)

b = "Шляпка гриба, покрытая " + g +  k  +  "держится на " … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.."